In [40]:
key = ['name','age','sex','city', 'sl.no']
value = ['prakash','31','male','junagadh', '1']

dict1 = {}

In [37]:
for i in key:
    for j in value:
        dict1[i] = j
        value.remove(j)
        break
print(dict1)

{'name': 'prakash', 'age': '31', 'sex': 'male', 'city': 'junagadh'}

In [42]:
for i in range(0, len(key)):
    dict1[key[i]] = value[i] 
print(dict1)

{'name': 'prakash', 'age': '31', 'sex': 'male', 'city': 'junagadh'}

In [26]:
dict1 = {'name': 'prakash', 'age': '31', 'sex': 'male', 'city': 'junagadh'}

In [40]:
name_list = ['prakash', 'swagat', 'apoo', 'ujjwal']
age_list = [ 25,28,26,23]
sex_list = ['male','male','male','male']
city_list = ['junagadh', 'odisa', 'vadodara','anand']

dict1['name'] = name_list
dict1['age'] = age_list
dict1['sex'] = sex_list
dict1['city'] = city_list
dict1
import pandas as pd

x = pd.DataFrame(dict1)
x.reset_index)()

      name  age   sex      city
0  prakash   25  male  junagadh
1   swagat   28  male     odisa
2     apoo   26  male  vadodara
3   ujjwal   23  male     anand

In [47]:
dict1

{'name': ['prakash', 'swagat', 'apoo', 'ujjwal'],
 'age': '31',
 'sex': 'male',
 'city': 'junagadh',
 'sr.no': 1}

In [9]:
#find factorial

user = int(input())
f = 1
for i in range(1,user+1):
    f= f*i
if user == 0:
    f=1
print(f)

0
1

In [23]:
list1 = [3,4,5,3,2,4,5,6,3]
set(list1)
import statistics as st
st.median(list1)

4

In [ ]:
im[]